Mathonix/CH32V203G6U-Fixed-VQF-IMU/User/main.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : main.c
 * Description        : LSM6DSV acquisition, fixed VQF, CAN/UART and diagnostics.
 *******************************************************************************/

#include "debug.h"
#include "ch32v20x_can.h"
#include "fixed_vqf.h"
#include "sections.h"
#include "imu_numeric.h"

#define BREATH_PWM_PERIOD       999U
#define BREATH_STEP_DELAY_MS    1U
#define SPI_TIMEOUT_LOOPS       4096U
#define SENSOR_SPI_ERROR_LIMIT  5U

#define LSM_CS_PORT             GPIOA
#define LSM_CS_PIN              GPIO_Pin_4
#define LSM_WHO_AM_I_REG        0x0FU
#define LSM_WHO_AM_I_VALUE      0x70U
#define LSM_CTRL1_REG           0x10U
#define LSM_CTRL2_REG           0x11U
#define LSM_CTRL3_REG           0x12U
#define LSM_CTRL6_REG           0x15U
#define LSM_CTRL7_REG           0x16U
#define LSM_CTRL8_REG           0x17U
#define LSM_HAODR_CFG_REG       0x62U
#if FIXED_VQF_SAMPLE_HZ == 2000U
#define LSM_CTRL1_CONFIG        0x1AU /* HAODR high-performance accel, 2 kHz */
#define LSM_CTRL2_CONFIG        0x1AU /* HAODR high-performance gyro, 2 kHz */
#elif FIXED_VQF_SAMPLE_HZ == 1000U
/* Read every other fresh 2 kHz sample; VQF's fixed step remains 1 ms. */
#define LSM_CTRL1_CONFIG        0x1AU /* HAODR high-performance accel, 2 kHz */
#define LSM_CTRL2_CONFIG        0x1AU /* HAODR high-performance gyro, 2 kHz */
#else
#error "FIXED_VQF_SAMPLE_HZ must be 1000 or 2000"
#endif
#define LSM_HAODR_CFG_CONFIG    0x01U /* HAODR_SEL=1: accel and gyro HAODR */
#if LSM6DSV_GYRO_FS_2000DPS
#define LSM_CTRL6_CONFIG         0x44U /* Gyro +/-2000 dps; LPF1 about 101 Hz */
#else
#define LSM_CTRL6_CONFIG         0x40U /* Gyro +/-125 dps; LPF1 about 101 Hz */
#endif
#define LSM_CTRL7_CONFIG         0x01U /* LPF1_G_EN=1 */
#if LSM6DSV_ACCEL_FS_4G
#define LSM_CTRL8_CONFIG         0x01U /* Accelerometer +/-4 g */
#else
#define LSM_CTRL8_CONFIG         0x00U /* Accelerometer +/-2 g */
#endif
#define LSM_CTRL3_CONFIG        0x44U /* BDU=1, IF_INC=1 for coherent burst reads */
#define LSM_STATUS_REG          0x1EU
#define LSM_OUT_TEMP_L_REG      0x20U
#define LSM_OUTX_L_G_REG        0x22U
#define LSM_OUTX_L_A_REG        0x28U

#define CAN_GYRO_ID             0x301U
#define CAN_ACCEL_ID            0x302U
#define CAN_EULER_ID            0x303U
#define CAN_GYRO_ENABLE         1U
#define CAN_ACCEL_ENABLE        1U
#define CAN_EULER_ENABLE        1U
#define CAN_GYRO_PERIOD_MS      1U
#define CAN_ACCEL_PERIOD_MS     1U
#define CAN_EULER_PERIOD_MS     1U
#define UART_BAUD_RATE          921600U
#define YAW_TEST_SETTLE_SAMPLES (20U * FIXED_VQF_SAMPLE_HZ)
#define YAW_TEST_END_SAMPLES    (80U * FIXED_VQF_SAMPLE_HZ)
#define OUTPUT_RATE_HZ          1000U
#define OUTPUT_DIVIDER          (FIXED_VQF_SAMPLE_HZ / OUTPUT_RATE_HZ)
#define VQF_PERIOD_US           (1000000U / FIXED_VQF_SAMPLE_HZ)
#define VQF_Q30_ONE             0x40000000L
#define YAW_HOLD_RATE_Q24        146409L /* 0.50 deg/s corrected gyro threshold */
#define YAW_REST_HOLD_ENABLE     0U      /* 0=disabled, 1=hold yaw at confirmed rest */

/* These variables can be inspected directly with WCH-Link/GDB. */
volatile uint8_t lsm_test_result = 0;
volatile uint8_t lsm_who_am_i = 0;
volatile uint8_t lsm_ctrl1 = 0;
volatile uint8_t lsm_ctrl2 = 0;
volatile uint8_t lsm_ctrl3 = 0;
volatile uint8_t lsm_ctrl6 = 0;
volatile uint8_t lsm_ctrl7 = 0;
volatile uint8_t lsm_ctrl8 = 0;
volatile uint8_t lsm_haodr_cfg = 0;
volatile uint8_t lsm_status = 0;
volatile uint32_t lsm_data_ready_count = 0U;
volatile uint32_t lsm_data_not_ready_count = 0U;
volatile int16_t lsm_temperature_raw = 0;
volatile int16_t lsm_gyro_x = 0;
volatile int16_t lsm_gyro_y = 0;
volatile int16_t lsm_gyro_z = 0;
volatile int16_t lsm_accel_x = 0;
volatile int16_t lsm_accel_y = 0;
volatile int16_t lsm_accel_z = 0;
/* CAN transmit diagnostics, visible in WCH-Link/GDB. */
volatile uint32_t can_tx_sequence = 0;
volatile uint32_t can_tx_ok_count = 0; /* confirmed by hardware */
volatile uint32_t can_tx_submit_count = 0;
volatile uint32_t can_tx_error_count = 0;
volatile uint32_t can_tx_no_mailbox_count = 0;
volatile uint32_t can_tx_failed_count = 0;
volatile uint32_t lsm_spi_error_count = 0;
volatile uint32_t lsm_spi_consecutive_errors = 0;
volatile uint32_t accel_saturation_count = 0;
volatile uint32_t can_gyro_saturation_count = 0;
volatile uint8_t can_tx_last_status = CAN_TxStatus_Pending;
volatile uint8_t can_tx_last_mailbox = 0xFFU;
volatile uint8_t can_error_status = 0;
volatile uint32_t uart_tx_frame_count = 0U;
volatile uint32_t uart_tx_dma_busy_count = 0U;
volatile uint32_t can_gyro_tx_count = 0U;
volatile uint32_t can_accel_tx_count = 0U;
volatile uint32_t can_euler_tx_count = 0U;
volatile int32_t vqf_euler_q16[3] = {0, 0, 0}; /* roll, pitch, yaw; Q16.16 degree */
volatile int16_t vqf_euler_cd[3] = {0, 0, 0};  /* CAN-compatible 0.01 degree/LSB */
volatile int32_t yaw_test_start_q16 = 0;
volatile int32_t yaw_test_end_q16 = 0;
volatile int32_t yaw_test_delta_q16 = 0;
volatile int32_t vqf_yaw_raw_q16 = 0;       /* unstabilized 6D VQF yaw for diagnostics */
volatile int32_t yaw_test_raw_start_q16 = 0;
volatile int32_t yaw_test_raw_end_q16 = 0;
volatile int32_t yaw_test_raw_delta_q16 = 0;
volatile uint32_t yaw_rest_hold_count = 0U;
volatile int16_t yaw_test_start_cd = 0;
volatile int16_t yaw_test_end_cd = 0;
volatile int16_t yaw_test_delta_cd = 0;
volatile uint8_t yaw_test_status = 0U; /* 0=settling, 1=measuring, 2=complete */
volatile uint8_t gyro_cal_status = 0U; /* 0=not started, 1=collecting, 2=valid */
volatile int32_t gyro_cal_bias_q16[3] = {0, 0, 0};

volatile float vqf_quat_f32[4] = {1.0f, 0.0f, 0.0f, 0.0f};
volatile int16_t vqf_quat_q15[4] = {32767, 0, 0, 0};
volatile int32_t vqf_quat_q30[4] = {VQF_Q30_ONE, 0, 0, 0};
volatile uint32_t vqf_update_count = 0U;
volatile uint8_t vqf_sample_pending = 0U;
volatile uint32_t vqf_timer_ticks = 0U;
volatile uint32_t vqf_missed_count = 0U; /* ticks missed by busy main loop (ISR) */
volatile uint32_t vqf_data_not_ready_count = 0U;
volatile uint32_t vqf_spi_sample_error_count = 0U;
static uint32_t vqf_sample_count = 0U;
static fixed_vqf_t fixed_vqf;
static int64_t gyro_lpf_state_q54[6] = {0};
static uint8_t gyro_lpf_initialized = 0U;
volatile q24_t vqf_gyro_filtered_q24[3] = {0, 0, 0};
static uint8_t uart2_tx_dma_buffer[16];
static uint8_t can_mailbox_active[3] = {0U, 0U, 0U};
static uint8_t can_initialized = 0U;
extern void TIM2_IRQHandler(void);
/* 1 kHz task execution-time diagnostics. TIM2 counts at 1 MHz, so one count is 1 us. */
volatile uint16_t cpu_busy_us_last = 0U;
volatile uint16_t cpu_busy_us_avg = 0U;
volatile uint16_t cpu_busy_us_max = 0U;
volatile uint16_t cpu_load_permille = 0U; /* Average busy time / sample period, in per mille. */
volatile uint32_t cpu_busy_us_sum = 0U;
volatile uint16_t cpu_busy_samples = 0U;



