Mathonix/CH32V203G6U-Fixed-VQF-IMU/User/main.c
SLOW_CODE static void VQF_SampleTimer_Init(void)
{
    TIM_TimeBaseInitTypeDef time_base = {0};
    NVIC_InitTypeDef nvic = {0};

    /* At 144 MHz SYSCLK, APB1 is 72 MHz and TIM2 receives the doubled 144 MHz timer clock. */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    time_base.TIM_Period = (uint16_t)(VQF_PERIOD_US - 1U);
    time_base.TIM_Prescaler = (uint16_t)((SystemCoreClock / 1000000U) - 1U);
    time_base.TIM_ClockDivision = TIM_CKD_DIV1;
    time_base.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM2, &time_base);
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    nvic.NVIC_IRQChannel = TIM2_IRQn;
    nvic.NVIC_IRQChannelPreemptionPriority = 1U;
    nvic.NVIC_IRQChannelSubPriority = 0U;
    nvic.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvic);
    /* VTF slot 0 dispatches TIM2 directly to the WCH fast-interrupt handler.
     * The ISR only acknowledges the timer and posts the fixed-rate VQF task flag. */
    SetVTFIRQ((uint32_t)TIM2_IRQHandler, TIM2_IRQn, 0U, ENABLE);
    TIM_Cmd(TIM2, ENABLE);
}

SLOW_CODE static void CAN1_Init_1M(void)
{
    GPIO_InitTypeDef gpio = {0};
    CAN_InitTypeDef can = {0};

    /* CAN1 default mapping: PA12=TX, PA11=RX. */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);

    gpio.GPIO_Pin = GPIO_Pin_12;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &gpio);

    gpio.GPIO_Pin = GPIO_Pin_11;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &gpio);

    CAN_DeInit(CAN1);
    CAN_StructInit(&can);
    can.CAN_TTCM = DISABLE;
    can.CAN_ABOM = ENABLE;
    can.CAN_AWUM = DISABLE;
    /* Do not wait for automatic retransmission when a bus peer is absent. */
    can.CAN_NART = ENABLE;
    can.CAN_RFLM = DISABLE;
    can.CAN_TXFP = DISABLE;
    can.CAN_Mode = CAN_Mode_Normal;
    can.CAN_SJW = CAN_SJW_1tq;
    can.CAN_BS1 = CAN_BS1_14tq;
    can.CAN_BS2 = CAN_BS2_3tq;
    can.CAN_Prescaler = 4U; /* 72 MHz PCLK1 / (4 * 18 tq) = 1 Mbit/s at 144 MHz SYSCLK. */

    can_initialized = (CAN_Init(CAN1, &can) == CAN_InitStatus_Success) ? 1U : 0U;
    if(can_initialized == 0U) can_error_status = 0xE0U;
}

SLOW_CODE static void UART2_Init_921600(void)
{
    GPIO_InitTypeDef gpio = {0};
    USART_InitTypeDef uart = {0};

    /* USART2 default mapping: PA2=TX, PA3=RX. */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
    gpio.GPIO_Pin = GPIO_Pin_2;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &gpio);
    gpio.GPIO_Pin = GPIO_Pin_3;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &gpio);

    uart.USART_BaudRate = UART_BAUD_RATE;
    uart.USART_WordLength = USART_WordLength_8b;
    uart.USART_StopBits = USART_StopBits_1;
    uart.USART_Parity = USART_Parity_No;
    uart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    uart.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_Init(USART2, &uart);
    USART_Cmd(USART2, ENABLE);

    /* DMA1 channel 7 is USART2_TX. The 16-byte JustFloat frame then costs
     * only a short memory fill in the 500 us fusion slot instead of ~174 us
     * of polling at 921600 baud. */
    {
        DMA_InitTypeDef dma = {0};
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
        DMA_DeInit(DMA1_Channel7);
        dma.DMA_PeripheralBaseAddr = (uint32_t)&USART2->DATAR;
        dma.DMA_MemoryBaseAddr = (uint32_t)uart2_tx_dma_buffer;
        dma.DMA_DIR = DMA_DIR_PeripheralDST;
        dma.DMA_BufferSize = sizeof(uart2_tx_dma_buffer);
        dma.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        dma.DMA_MemoryInc = DMA_MemoryInc_Enable;
        dma.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
        dma.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
        dma.DMA_Mode = DMA_Mode_Normal;
        dma.DMA_Priority = DMA_Priority_High;
        dma.DMA_M2M = DMA_M2M_Disable;
        DMA_Init(DMA1_Channel7, &dma);
        /* DMA_Init loads CNTR with BufferSize even while the channel is disabled.
         * Mark it idle so the first 1 kHz frame is allowed to start. */
        DMA_SetCurrDataCounter(DMA1_Channel7, 0U);
        USART_DMACmd(USART2, USART_DMAReq_Tx, ENABLE);
    }
}

static int32_t VQF_Q30_Mul2(int32_t a, int32_t b)
{
    int64_t value = ((int64_t)a * (int64_t)b) >> 29;
    if(value > 2147483647LL) value = 2147483647LL;
    if(value < -2147483648LL) value = -2147483648LL;
    return (int32_t)value;
}

static uint32_t VQF_ISqrt64(uint64_t value)
{
    uint64_t bit = (uint64_t)1U << 62;
    uint64_t result = 0U;
    while(bit > value) bit >>= 2;
    while(bit != 0U)
    {
        if(value >= result + bit)
        {
            value -= result + bit;
            result = (result >> 1) + bit;
        }
        else result >>= 1;
        bit >>= 2;
    }
    return (uint32_t)result;
}

/* atan2 CORDIC with a Q16.16 degree accumulator. The previous centidegree
 * table quantized every Euler result before UART transmission. 23 useful
 * iterations make the final CORDIC step one Q16.16 degree LSB; total
 * conversion error remains comfortably below 0.001 degree for normalized inputs. */
static int32_t VQF_Atan2_DegQ16(int32_t y_in, int32_t x_in)
{
    static const int32_t atan_deg_q16[23] = {
        2949120, 1740967, 919879, 466945, 234379, 117304,
        58666, 29335, 14668, 7334, 3667, 1833, 917, 458,
        229, 115, 57, 29, 14, 7, 4, 2, 1
    };
    int32_t x = x_in >> 2;
    int32_t y = y_in >> 2;
    int32_t angle_q16 = 0;
    uint8_t i;

    if((x == 0) && (y == 0)) return 0;
    if(x < 0)
    {
        angle_q16 = (y >= 0) ? (180L << 16) : -(180L << 16);
        x = -x;
        y = -y;
    }
    for(i = 0U; i < 23U; i++)
    {
        int32_t old_x;
        if(y == 0) break;
        old_x = x;
        if(y > 0)
        {
            x += y >> i;
            y -= old_x >> i;
            angle_q16 += atan_deg_q16[i];
        }
        else
        {
            x -= y >> i;
            y += old_x >> i;
            angle_q16 -= atan_deg_q16[i];
        }
    }
    if(angle_q16 > (180L << 16)) angle_q16 -= (360L << 16);
    if(angle_q16 < -(180L << 16)) angle_q16 += (360L << 16);
    return angle_q16;
}

static int16_t VQF_DegQ16_ToCentiDeg(int32_t angle_q16)
{
    int64_t scaled = (int64_t)angle_q16 * 100;
    if(scaled >= 0) scaled += 32768;
    else scaled -= 32768;
    return (int16_t)(scaled / 65536);
}

