Mathonix/CH32V203G6U-Fixed-VQF-IMU/User/main.c
static uint8_t VQF_GyroRateNearZero(void)
{
    uint8_t i;
    for(i = 0U; i < 3U; i++)
    {
        int64_t corrected = (int64_t)vqf_gyro_filtered_q24[i] -
                            ((int64_t)gyro_cal_bias_q16[i] * 256LL);
        if(corrected > YAW_HOLD_RATE_Q24 || corrected < -YAW_HOLD_RATE_Q24) return 0U;
    }
    return 1U;
}
static int32_t VQF_WrapDeltaDegQ16(int32_t delta_q16);

static void VQF_UpdateEuler(const int32_t q[4])
{
    int32_t r00 = VQF_Q30_ONE - VQF_Q30_Mul2(q[2], q[2]) - VQF_Q30_Mul2(q[3], q[3]);
    int32_t r10 = VQF_Q30_Mul2(q[1], q[2]) + VQF_Q30_Mul2(q[0], q[3]);
    int32_t r20 = VQF_Q30_Mul2(q[1], q[3]) - VQF_Q30_Mul2(q[0], q[2]);
    int32_t r21 = VQF_Q30_Mul2(q[2], q[3]) + VQF_Q30_Mul2(q[0], q[1]);
    int32_t r22 = VQF_Q30_ONE - VQF_Q30_Mul2(q[1], q[1]) - VQF_Q30_Mul2(q[2], q[2]);
    uint64_t horizontal_sq = (uint64_t)((int64_t)r00 * r00) +
                             (uint64_t)((int64_t)r10 * r10);
    int32_t horizontal = (int32_t)VQF_ISqrt64(horizontal_sq);

    vqf_euler_q16[0] = VQF_Atan2_DegQ16(r21, r22);
    vqf_euler_q16[1] = VQF_Atan2_DegQ16(-r20, horizontal);
    vqf_yaw_raw_q16 = VQF_Atan2_DegQ16(r10, r00);
    {
        static int32_t yaw_offset_q16 = 0;
        static int32_t yaw_held_q16 = 0;
        static uint8_t yaw_initialized = 0U;
        int32_t yaw_out;

        if(yaw_initialized == 0U)
        {
            yaw_held_q16 = vqf_yaw_raw_q16;
            yaw_initialized = 1U;
        }

        if(YAW_REST_HOLD_ENABLE &&
           fixed_vqf_get_rest_detected(&fixed_vqf) &&
           VQF_GyroRateNearZero())
        {
            /* Heading is unobservable without a magnetometer. During confirmed
             * rest, hold the last output heading and continuously update the
             * offset to the raw 6D quaternion. Motion resumes without a jump. */
            yaw_offset_q16 = VQF_WrapDeltaDegQ16(yaw_held_q16 - vqf_yaw_raw_q16);
            yaw_out = yaw_held_q16;
            yaw_rest_hold_count++;
        }
        else
        {
            yaw_out = VQF_WrapDeltaDegQ16(vqf_yaw_raw_q16 + yaw_offset_q16);
            yaw_held_q16 = yaw_out;
        }
        vqf_euler_q16[2] = yaw_out;
    }

    /* Preserve the existing Damiao-compatible CAN payload resolution. */
    vqf_euler_cd[0] = VQF_DegQ16_ToCentiDeg(vqf_euler_q16[0]);
    vqf_euler_cd[1] = VQF_DegQ16_ToCentiDeg(vqf_euler_q16[1]);
    vqf_euler_cd[2] = VQF_DegQ16_ToCentiDeg(vqf_euler_q16[2]);
}

static int32_t VQF_WrapDeltaDegQ16(int32_t delta_q16)
{
    while(delta_q16 > (180L << 16)) delta_q16 -= (360L << 16);
    while(delta_q16 < -(180L << 16)) delta_q16 += (360L << 16);
    return delta_q16;
}

static int16_t VQF_Q30_To_Q15(int32_t value)
{
    int32_t q = value >> 15;
    if(q > 32767) q = 32767;
    if(q < -32768) q = -32768;
    return (int16_t)q;
}

/* 80 Hz second-order Butterworth software LPF. Together with the sensor's
 * 101 Hz LPF1 this removes high-frequency rate noise while keeping only a
 * few milliseconds of delay for attitude motion. */
static int32_t VQF_RoundShift30(int64_t value)
{
    if(value >= 0) value += (1LL << 29);
    else value -= (1LL << 29);
    value /= (1LL << 30);
    if(value > 2147483647LL) value = 2147483647LL;
    if(value < -2147483648LL) value = -2147483648LL;
    return (int32_t)value;
}

/* Feedback from the full precision DF-II state.  Multiplying a Q30
 * coefficient directly by the Q54 state would overflow 64 bits; split the
 * state into its integer and remainder parts instead. */
static int64_t VQF_Q30MulState(int32_t coefficient, int64_t state_q54)
{
    int64_t state_q24 = state_q54 / (1LL << 30);
    int64_t remainder = state_q54 - state_q24 * (1LL << 30);
    return (int64_t)coefficient * state_q24 +
           (int64_t)VQF_RoundShift30((int64_t)coefficient * remainder);
}

static void VQF_GyroSoftwareLPF(const q24_t input[3], q24_t output[3])
{
#if FIXED_VQF_SAMPLE_HZ == 2000U
    static const int32_t b[3] = {14344332, 28688664, 14344332};
    static const int32_t a[2] = {-1768946685, 752582188};
#else
    static const int32_t b[3] = {49533645, 99067291, 49533645};
    static const int32_t a[2] = {-1403686611, 528079369};
#endif
    uint8_t i;

    if(gyro_lpf_initialized == 0U)
    {
        for(i = 0U; i < 3U; i++)
        {
            gyro_lpf_state_q54[2U*i] = (int64_t)input[i] * (VQF_Q30_ONE - b[0]);
            gyro_lpf_state_q54[2U*i+1U] = (int64_t)input[i] * (b[2] - a[1]);
            output[i] = input[i];
        }
        gyro_lpf_initialized = 1U;
        return;
    }

    for(i = 0U; i < 3U; i++)
    {
        int64_t y54 = (int64_t)b[0] * input[i] + gyro_lpf_state_q54[2U*i];
        int32_t y = VQF_RoundShift30(y54);
        gyro_lpf_state_q54[2U*i] = (int64_t)b[1] * input[i] -
                                    VQF_Q30MulState(a[0], y54) + gyro_lpf_state_q54[2U*i+1U];
        gyro_lpf_state_q54[2U*i+1U] = (int64_t)b[2] * input[i] - VQF_Q30MulState(a[1], y54);
        output[i] = y;
    }
}

/* Q1.30 cannot represent +/-4 g. Saturate instead of overflowing the
 * signed multiply; retain a diagnostic so downstream can reject clipped data. */
static q30_t VQF_AccelRawToQ30(int16_t raw, int32_t scale)
{
    uint8_t saturated;
    q30_t value = imu_accel_raw_to_q30(raw, scale, &saturated);
    accel_saturation_count += saturated;
    return value;
}

static void VQF_UpdateFromLSM6DSV(uint8_t update_output)
{
    q24_t gyro_q24[3];
    q30_t accel_q30[3];
    q30_t quat_q30[4];
    int32_t bias_q16[3];
    uint8_t i;
    uint32_t accel_clipped_before = accel_saturation_count;

    /* No software floating point in the 1 kHz path. The RV32 M extension
     * executes the 32x32->64 products used by the fixed-point conversion. */
    gyro_q24[0] = fixed_vqf_gyro_raw_to_q24(lsm_gyro_x);
    gyro_q24[1] = fixed_vqf_gyro_raw_to_q24(lsm_gyro_y);
    gyro_q24[2] = fixed_vqf_gyro_raw_to_q24(lsm_gyro_z);
#if LSM6DSV_ACCEL_FS_4G
    /* +/-4 g, raw/8192 g -> Q1.30. */
    accel_q30[0] = VQF_AccelRawToQ30(lsm_accel_x, 131072L);
    accel_q30[1] = VQF_AccelRawToQ30(lsm_accel_y, 131072L);
    accel_q30[2] = VQF_AccelRawToQ30(lsm_accel_z, 131072L);
#else
    /* +/-2 g, raw/16384 g -> Q1.30. */
    accel_q30[0] = VQF_AccelRawToQ30(lsm_accel_x, 65536L);
    accel_q30[1] = VQF_AccelRawToQ30(lsm_accel_y, 65536L);
    accel_q30[2] = VQF_AccelRawToQ30(lsm_accel_z, 65536L);
#endif

    VQF_GyroSoftwareLPF(gyro_q24, gyro_q24);
    vqf_gyro_filtered_q24[0] = gyro_q24[0];
    vqf_gyro_filtered_q24[1] = gyro_q24[1];
    vqf_gyro_filtered_q24[2] = gyro_q24[2];
    fixed_vqf_update_gyr(&fixed_vqf, gyro_q24);
    /* A saturated axis no longer represents its measured magnitude. */
    if(accel_saturation_count == accel_clipped_before)
        fixed_vqf_update_acc(&fixed_vqf, accel_q30);
    fixed_vqf_get_q30(&fixed_vqf, quat_q30);
    fixed_vqf_get_bias_q16(&fixed_vqf, bias_q16);

    gyro_cal_status = fixed_vqf_get_rest_detected(&fixed_vqf) ? 2U : 1U;
    for(i = 0U; i < 3U; i++) gyro_cal_bias_q16[i] = bias_q16[i];
    for(i = 0U; i < 4U; i++)
    {
        vqf_quat_q30[i] = quat_q30[i];
        vqf_quat_q15[i] = VQF_Q30_To_Q15(quat_q30[i]);
    }
    vqf_sample_count++;
    vqf_update_count++;
    if(update_output != 0U)
    {
        /* Euler conversion and communications remain at 1 kHz while the
         * quaternion and Full VQF state update at FIXED_VQF_SAMPLE_HZ. */
        VQF_UpdateEuler(quat_q30);
        if(vqf_update_count == YAW_TEST_SETTLE_SAMPLES)
        {
            yaw_test_start_q16 = vqf_euler_q16[2];
            yaw_test_raw_start_q16 = vqf_yaw_raw_q16;
            yaw_test_start_cd = vqf_euler_cd[2];
            yaw_test_status = 1U;
        }
        else if(vqf_update_count == YAW_TEST_END_SAMPLES)
        {
            yaw_test_end_q16 = vqf_euler_q16[2];
            yaw_test_delta_q16 = VQF_WrapDeltaDegQ16(yaw_test_end_q16 - yaw_test_start_q16);
            yaw_test_raw_end_q16 = vqf_yaw_raw_q16;
            yaw_test_raw_delta_q16 = VQF_WrapDeltaDegQ16(yaw_test_raw_end_q16 - yaw_test_raw_start_q16);
            yaw_test_end_cd = vqf_euler_cd[2];
            yaw_test_delta_cd = VQF_DegQ16_ToCentiDeg(yaw_test_delta_q16);
            yaw_test_status = 2U;
        }
    }
}
/* Read and acknowledge each completed request before reusing its mailbox. */
static void CAN1_PollTx(void)
{
    static const uint32_t done[3] = {
        CAN_TSTATR_RQCP0, CAN_TSTATR_RQCP1, CAN_TSTATR_RQCP2
    };
    static const uint32_t ok[3] = {
        CAN_TSTATR_TXOK0, CAN_TSTATR_TXOK1, CAN_TSTATR_TXOK2
    };
    uint32_t status;
    uint8_t i;
    if(can_initialized == 0U) return;
    status = CAN1->TSTATR;
    for(i = 0U; i < 3U; i++)
    {
        if((status & done[i]) == 0U) continue;
        if(can_mailbox_active[i] != 0U)
        {
            if((status & ok[i]) != 0U)
            {
                can_tx_ok_count++;
                can_tx_last_status = CAN_TxStatus_Ok;
            }
            else
            {
                can_tx_failed_count++;
                can_tx_error_count++;
                can_error_status = CAN1->ERRSR;
                can_tx_last_status = CAN_TxStatus_Failed;
            }
            can_mailbox_active[i] = 0U;
        }
        CAN1->TSTATR = done[i];
    }
}

static void CAN1_SendDamiaoFrame(uint16_t id, uint8_t reg, int16_t x, int16_t y, int16_t z)
{
    CanTxMsg message = {0};
    uint8_t mailbox;

    message.StdId = id;
    message.ExtId = 0U;
    message.IDE = CAN_Id_Standard;
    message.RTR = CAN_RTR_Data;
    message.DLC = 8U;
    message.Data[0] = reg;
    message.Data[1] = 0U;
    message.Data[2] = (uint8_t)x;
    message.Data[3] = (uint8_t)((uint16_t)x >> 8);
    message.Data[4] = (uint8_t)y;
    message.Data[5] = (uint8_t)((uint16_t)y >> 8);
    message.Data[6] = (uint8_t)z;
    message.Data[7] = (uint8_t)((uint16_t)z >> 8);

    CAN1_PollTx();
    mailbox = CAN_Transmit(CAN1, &message);
    can_tx_last_mailbox = mailbox;
    can_tx_last_status = CAN_TxStatus_Pending;
    if(mailbox == CAN_TxStatus_NoMailBox)
    {
        can_tx_error_count++;
        can_tx_no_mailbox_count++;
        can_tx_last_status = CAN_TxStatus_NoMailBox;
        can_error_status = CAN1->ERRSR;
    }
    else
    {
        can_mailbox_active[mailbox] = 1U;
        can_tx_submit_count++;
    }
    can_tx_sequence++;
}

static int16_t LSM_GyroToCentiDps(int16_t raw)
{
    uint8_t saturated;
    int16_t value = imu_gyro_raw_to_centidps(raw, LSM6DSV_GYRO_FS_2000DPS, &saturated);
    can_gyro_saturation_count += saturated;
    return value;
}

static int16_t LSM_AccelToMg(int16_t raw)
{
#if LSM6DSV_ACCEL_FS_4G
    /* +/-4 g, 8192 LSB/g => 0.122070 mg/LSB. */
    return (int16_t)(((int32_t)raw * 125) / 1024);
#else
    /* +/-2 g, 16384 LSB/g => 0.061035 mg/LSB. */
    return (int16_t)(((int32_t)raw * 125) / 2048);
#endif
}

static void CAN1_Service(uint16_t elapsed_ms)
{
    static uint16_t gyro_elapsed = 0U;
    static uint16_t accel_elapsed = 0U;
    static uint16_t euler_elapsed = 0U;
    int16_t x, y, z;

    if(can_initialized == 0U) return;
    CAN1_PollTx();
    gyro_elapsed = (uint16_t)(gyro_elapsed + elapsed_ms);
    accel_elapsed = (uint16_t)(accel_elapsed + elapsed_ms);
    euler_elapsed = (uint16_t)(euler_elapsed + elapsed_ms);

    if(CAN_GYRO_ENABLE && (gyro_elapsed >= CAN_GYRO_PERIOD_MS))
    {
        gyro_elapsed = (uint16_t)(gyro_elapsed - CAN_GYRO_PERIOD_MS);
        CAN1_SendDamiaoFrame(CAN_GYRO_ID, 2U,
                             LSM_GyroToCentiDps(lsm_gyro_x),
                             LSM_GyroToCentiDps(lsm_gyro_y),
                             LSM_GyroToCentiDps(lsm_gyro_z));
        can_gyro_tx_count++;
    }
    if(CAN_ACCEL_ENABLE && (accel_elapsed >= CAN_ACCEL_PERIOD_MS))
    {
        accel_elapsed = (uint16_t)(accel_elapsed - CAN_ACCEL_PERIOD_MS);
        CAN1_SendDamiaoFrame(CAN_ACCEL_ID, 1U,
                             LSM_AccelToMg(lsm_accel_x),
                             LSM_AccelToMg(lsm_accel_y),
                             LSM_AccelToMg(lsm_accel_z));
        can_accel_tx_count++;
    }
    if(CAN_EULER_ENABLE && (euler_elapsed >= CAN_EULER_PERIOD_MS))
    {
        euler_elapsed = (uint16_t)(euler_elapsed - CAN_EULER_PERIOD_MS);
        /* Damiao order: Pitch, Yaw, Roll; unit here is 0.01 degree. */
        x = vqf_euler_cd[1];
        y = vqf_euler_cd[2];
        z = vqf_euler_cd[0];
        CAN1_SendDamiaoFrame(CAN_EULER_ID, 3U, x, y, z);
        can_euler_tx_count++;
    }
}

static void UART2_PackFloatLE(uint8_t *dst, float value)
{
    union { float f; uint8_t b[4]; } data;
    data.f = value;
    dst[0] = data.b[0];
    dst[1] = data.b[1];
    dst[2] = data.b[2];
    dst[3] = data.b[3];
}

