Mathonix/CH32V203G6U-Fixed-VQF-IMU/User/main.c
static void UART2_SendEulerJustFloat(void)
{
    if(DMA_GetCurrDataCounter(DMA1_Channel7) != 0U)
    {
        uart_tx_dma_busy_count++;
        return;
    }

    UART2_PackFloatLE(&uart2_tx_dma_buffer[0], (float)vqf_euler_q16[0] / 65536.0f);
    UART2_PackFloatLE(&uart2_tx_dma_buffer[4], (float)vqf_euler_q16[1] / 65536.0f);
    UART2_PackFloatLE(&uart2_tx_dma_buffer[8], (float)vqf_euler_q16[2] / 65536.0f);
    uart2_tx_dma_buffer[12] = 0x00U;
    uart2_tx_dma_buffer[13] = 0x00U;
    uart2_tx_dma_buffer[14] = 0x80U;
    uart2_tx_dma_buffer[15] = 0x7FU;

    DMA_Cmd(DMA1_Channel7, DISABLE);
    DMA_ClearFlag(DMA1_FLAG_GL7);
    DMA1_Channel7->MADDR = (uint32_t)uart2_tx_dma_buffer;
    DMA_SetCurrDataCounter(DMA1_Channel7, sizeof(uart2_tx_dma_buffer));
    DMA_Cmd(DMA1_Channel7, ENABLE);
    uart_tx_frame_count++;
}

SLOW_CODE static void Status_LED_Init(void)
{
    GPIO_InitTypeDef gpio = {0};
    TIM_TimeBaseInitTypeDef time_base = {0};
    TIM_OCInitTypeDef output_compare = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_TIM1, ENABLE);

    gpio.GPIO_Pin = GPIO_Pin_9;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &gpio);

    time_base.TIM_Period = BREATH_PWM_PERIOD;
    time_base.TIM_Prescaler = (uint16_t)((SystemCoreClock / 1000000U) - 1U);
    time_base.TIM_ClockDivision = TIM_CKD_DIV1;
    time_base.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM1, &time_base);

    output_compare.TIM_OCMode = TIM_OCMode_PWM1;
    output_compare.TIM_OutputState = TIM_OutputState_Enable;
    output_compare.TIM_Pulse = 0;
    output_compare.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC2Init(TIM1, &output_compare);
    TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE);
}

SLOW_CODE static void LSM6DSV_SPI_Init(void)
{
    GPIO_InitTypeDef gpio = {0};
    SPI_InitTypeDef spi = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_SPI1, ENABLE);

    /* Drive CS high before enabling SPI. */
    gpio.GPIO_Pin = LSM_CS_PIN;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(LSM_CS_PORT, &gpio);
    GPIO_SetBits(LSM_CS_PORT, LSM_CS_PIN);

    /* PA5=SCK and PA7=MOSI. */
    gpio.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_7;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &gpio);

    /* PA6=MISO. */
    gpio.GPIO_Pin = GPIO_Pin_6;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &gpio);

    /* LSM6DSV supports SPI mode 0 and mode 3; use mode 3 here. */
    spi.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    spi.SPI_Mode = SPI_Mode_Master;
    spi.SPI_DataSize = SPI_DataSize_8b;
    spi.SPI_CPOL = SPI_CPOL_High;
    spi.SPI_CPHA = SPI_CPHA_2Edge;
    spi.SPI_NSS = SPI_NSS_Soft;
    spi.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16; /* 9 MHz, below the 10 MHz sensor limit. */
    spi.SPI_FirstBit = SPI_FirstBit_MSB;
    spi.SPI_CRCPolynomial = 7;
    SPI_Init(SPI1, &spi);
    SPI_Cmd(SPI1, ENABLE);
}

/* Only used after a failed transaction, with CS already deasserted. */
static void SPI1_Recover(void)
{
    SPI_Cmd(SPI1, DISABLE);
    if((SPI1->STATR & (SPI_I2S_FLAG_RXNE | SPI_I2S_FLAG_OVR)) != 0U)
        (void)SPI_I2S_ReceiveData(SPI1);
    (void)SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_OVR);
    SPI_Cmd(SPI1, ENABLE);
    lsm_spi_error_count++;
    lsm_spi_consecutive_errors++;
}

/* Bounded polling: never write or read a byte after its ready flag timed out. */
static uint8_t SPI1_Transfer(uint8_t data, uint8_t *received)
{
    uint32_t timeout = SPI_TIMEOUT_LOOPS;
    while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET)
        if(--timeout == 0U) return 0U;
    SPI_I2S_SendData(SPI1, data);

    timeout = SPI_TIMEOUT_LOOPS;
    while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET)
        if(--timeout == 0U) return 0U;
    *received = (uint8_t)SPI_I2S_ReceiveData(SPI1);
    return 1U;
}

static uint8_t LSM6DSV_ReadReg(uint8_t reg, volatile uint8_t *value)
{
    uint8_t ignored;
    uint8_t result;
    uint8_t ok;
    GPIO_ResetBits(LSM_CS_PORT, LSM_CS_PIN);
    ok = SPI1_Transfer((uint8_t)(reg | 0x80U), &ignored) &&
         SPI1_Transfer(0xFFU, &result);
    GPIO_SetBits(LSM_CS_PORT, LSM_CS_PIN);
    if(ok) *value = result;
    if(!ok) SPI1_Recover();
    return ok;
}

static uint8_t LSM6DSV_WriteReg(uint8_t reg, uint8_t value)
{
    uint8_t ignored;
    uint8_t ok;
    GPIO_ResetBits(LSM_CS_PORT, LSM_CS_PIN);
    ok = SPI1_Transfer((uint8_t)(reg & 0x7FU), &ignored) &&
         SPI1_Transfer(value, &ignored);
    GPIO_SetBits(LSM_CS_PORT, LSM_CS_PIN);
    if(!ok) SPI1_Recover();
    return ok;
}

static uint8_t LSM6DSV_ReadBurst(uint8_t start_reg, uint8_t *data, uint8_t length)
{
    uint8_t i;
    uint8_t ignored;
    uint8_t ok;
    GPIO_ResetBits(LSM_CS_PORT, LSM_CS_PIN);
    ok = SPI1_Transfer((uint8_t)(start_reg | 0x80U), &ignored);
    for(i = 0U; ok && i < length; i++) ok = SPI1_Transfer(0xFFU, &data[i]);
    GPIO_SetBits(LSM_CS_PORT, LSM_CS_PIN);
    if(!ok) SPI1_Recover();
    return ok;
}

static int16_t LSM6DSV_Pack16(const uint8_t *data)
{
    return (int16_t)(((uint16_t)data[1] << 8) | data[0]);
}

/* 0: not ready; 1: valid sample; 2: SPI transport error. */
static uint8_t LSM6DSV_UpdateData(void)
{
    uint8_t data[14];
    uint8_t status;
    if(!LSM6DSV_ReadReg(LSM_STATUS_REG, &status)) return 2U;
    lsm_status = status;
    if((status & 0x03U) != 0x03U)
    {
        lsm_data_not_ready_count++;
        return 0U;
    }
    if(!LSM6DSV_ReadBurst(LSM_OUT_TEMP_L_REG, data, sizeof(data))) return 2U;
    lsm_data_ready_count++;
    lsm_spi_consecutive_errors = 0U;
    lsm_temperature_raw = LSM6DSV_Pack16(&data[0]);
    lsm_gyro_x = LSM6DSV_Pack16(&data[2]);
    lsm_gyro_y = LSM6DSV_Pack16(&data[4]);
    lsm_gyro_z = LSM6DSV_Pack16(&data[6]);
    lsm_accel_x = LSM6DSV_Pack16(&data[8]);
    lsm_accel_y = LSM6DSV_Pack16(&data[10]);
    lsm_accel_z = LSM6DSV_Pack16(&data[12]);
    return 1U;
}

