Mathonix/CH32V203G6U-Fixed-VQF-IMU/User/main.c
SLOW_CODE static void LSM6DSV_Test(void)
{
    int32_t accel_activity;
    uint8_t sample;

    lsm_test_result = 0U;
    Delay_Ms(20);
    if(!LSM6DSV_ReadReg(LSM_WHO_AM_I_REG, &lsm_who_am_i))
        goto spi_error;
    if(lsm_who_am_i != LSM_WHO_AM_I_VALUE)
    {
        lsm_test_result = 0xE1U;
        return;
    }

    /* Power down, select HAODR, then start gyro before accelerometer. */
    if(!LSM6DSV_WriteReg(LSM_CTRL3_REG, LSM_CTRL3_CONFIG) ||
       !LSM6DSV_WriteReg(LSM_CTRL1_REG, 0x00U) ||
       !LSM6DSV_WriteReg(LSM_CTRL2_REG, 0x00U) ||
       !LSM6DSV_WriteReg(LSM_HAODR_CFG_REG, LSM_HAODR_CFG_CONFIG) ||
       !LSM6DSV_WriteReg(LSM_CTRL2_REG, LSM_CTRL2_CONFIG)) goto spi_error;
    Delay_Ms(1);
    if(!LSM6DSV_WriteReg(LSM_CTRL1_REG, LSM_CTRL1_CONFIG) ||
       !LSM6DSV_WriteReg(LSM_CTRL6_REG, LSM_CTRL6_CONFIG) ||
       !LSM6DSV_WriteReg(LSM_CTRL7_REG, LSM_CTRL7_CONFIG) ||
       !LSM6DSV_WriteReg(LSM_CTRL8_REG, LSM_CTRL8_CONFIG)) goto spi_error;
    Delay_Ms(40);
    if(!LSM6DSV_ReadReg(LSM_CTRL1_REG, &lsm_ctrl1) ||
       !LSM6DSV_ReadReg(LSM_CTRL2_REG, &lsm_ctrl2) ||
       !LSM6DSV_ReadReg(LSM_CTRL3_REG, &lsm_ctrl3) ||
       !LSM6DSV_ReadReg(LSM_CTRL6_REG, &lsm_ctrl6) ||
       !LSM6DSV_ReadReg(LSM_CTRL7_REG, &lsm_ctrl7) ||
       !LSM6DSV_ReadReg(LSM_CTRL8_REG, &lsm_ctrl8) ||
       !LSM6DSV_ReadReg(LSM_HAODR_CFG_REG, &lsm_haodr_cfg)) goto spi_error;
    if((lsm_ctrl1 != LSM_CTRL1_CONFIG) || (lsm_ctrl2 != LSM_CTRL2_CONFIG) ||
       ((lsm_ctrl3 & LSM_CTRL3_CONFIG) != LSM_CTRL3_CONFIG) ||
       (lsm_ctrl6 != LSM_CTRL6_CONFIG) ||
       ((lsm_ctrl7 & 0x01U) != LSM_CTRL7_CONFIG) ||
       ((lsm_ctrl8 & 0x03U) != LSM_CTRL8_CONFIG) ||
       ((lsm_haodr_cfg & 0x03U) != LSM_HAODR_CFG_CONFIG))
    {
        lsm_test_result = 0xE2U;
        return;
    }

    Delay_Ms(100);
    sample = LSM6DSV_UpdateData();
    if(sample == 2U) goto spi_error;
    if(sample == 0U) { lsm_test_result = 0xE3U; return; }
    accel_activity = (lsm_accel_x < 0) ? -(int32_t)lsm_accel_x : lsm_accel_x;
    accel_activity += (lsm_accel_y < 0) ? -(int32_t)lsm_accel_y : lsm_accel_y;
    accel_activity += (lsm_accel_z < 0) ? -(int32_t)lsm_accel_z : lsm_accel_z;
    if((accel_activity < 500) ||
       ((lsm_accel_x == -1) && (lsm_accel_y == -1) && (lsm_accel_z == -1)))
    {
        lsm_test_result = 0xE3U;
        return;
    }
    lsm_spi_consecutive_errors = 0U;
    lsm_test_result = 3U;
    return;
spi_error:
    lsm_test_result = 0xE4U;
}

int main(void)
{
    uint16_t brightness = 0;
    int16_t step = 2;
    uint16_t cpu_start_us;
    uint16_t cpu_end_us;
    uint16_t cpu_busy_us;
    uint8_t output_phase = 0U;
    uint8_t output_due;
    uint8_t sample_result;
    uint8_t timer_was_enabled = 1U;
    uint32_t irq_status;

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    SystemCoreClockUpdate();
    Delay_Init();
    Status_LED_Init();
    LSM6DSV_SPI_Init();
    LSM6DSV_Test();
    CAN1_Init_1M();
    UART2_Init_921600();
    fixed_vqf_init(&fixed_vqf);
    VQF_SampleTimer_Init();

    while(1)
    {
        if(lsm_test_result == 3U)
        {
            /* TIM2 supplies the fixed VQF cadence (0.5 ms at default 2 kHz). */
            if(vqf_sample_pending == 0U) continue;
            /* Atomic disable-and-save of MIE; only restore it if already set. */
            __asm volatile ("csrrc %0, mstatus, %1"
                            : "=r"(irq_status) : "r"(0x8U) : "memory");
            sample_result = vqf_sample_pending;
            vqf_sample_pending = 0U;
            if((irq_status & 0x8U) != 0U)
                __asm volatile ("csrs mstatus, %0" :: "r"(0x8U) : "memory");
            if(sample_result == 0U) continue;
            cpu_start_us = (uint16_t)TIM2->CNT;

            output_phase++;
            output_due = 0U;
            if(output_phase >= OUTPUT_DIVIDER)
            {
                output_phase = 0U;
                output_due = 1U;
            }

            sample_result = LSM6DSV_UpdateData();
            if(sample_result != 1U)
            {
                if(sample_result == 0U) vqf_data_not_ready_count++;
                else
                {
                    vqf_spi_sample_error_count++;
                    if(lsm_spi_consecutive_errors >= SENSOR_SPI_ERROR_LIMIT)
                        lsm_test_result = 0xE4U;
                }
                goto sample_done;
            }
            VQF_UpdateFromLSM6DSV(output_due);
            if(output_due != 0U)
            {
                CAN1_Service(1U);
                UART2_SendEulerJustFloat();
                TIM_SetCompare2(TIM1, brightness);
                if((step > 0) && (brightness >= (BREATH_PWM_PERIOD - 2U)))
                {
                    step = -2;
                }
                else if((step < 0) && (brightness <= 2U))
                {
                    step = 2;
                }
                brightness = (uint16_t)((int32_t)brightness + step);
            }

sample_done:
            cpu_end_us = (uint16_t)TIM2->CNT;
            if(cpu_end_us >= cpu_start_us)
            {
                cpu_busy_us = (uint16_t)(cpu_end_us - cpu_start_us);
            }
            else
            {
                cpu_busy_us = (uint16_t)(VQF_PERIOD_US + cpu_end_us - cpu_start_us);
            }

            CAN1_PollTx();
            cpu_busy_us_last = cpu_busy_us;
            if(cpu_busy_us > cpu_busy_us_max) cpu_busy_us_max = cpu_busy_us;
            cpu_busy_us_sum += cpu_busy_us;
            cpu_busy_samples++;
            if(cpu_busy_samples >= FIXED_VQF_SAMPLE_HZ)
            {
                cpu_busy_us_avg = (uint16_t)(cpu_busy_us_sum / cpu_busy_samples);
                cpu_load_permille = (uint16_t)(((uint32_t)cpu_busy_us_avg * 1000U) / VQF_PERIOD_US);
                cpu_busy_us_sum = 0U;
                cpu_busy_samples = 0U;
            }

        }
        else
        {
            /* Never publish stale IMU values during a sensor fault. */
            if(timer_was_enabled != 0U)
            {
                TIM_Cmd(TIM2, DISABLE);
                TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
                timer_was_enabled = 0U;
            }
            TIM_SetCompare2(TIM1, BREATH_PWM_PERIOD);
            Delay_Ms(100);
            CAN1_PollTx();
            TIM_SetCompare2(TIM1, 0U);
            Delay_Ms(100);
            CAN1_PollTx();
            LSM6DSV_SPI_Init();
            LSM6DSV_Test();
            if(lsm_test_result == 3U)
            {
                fixed_vqf_init(&fixed_vqf);
                gyro_lpf_initialized = 0U;
                vqf_update_count = 0U;
                vqf_sample_count = 0U;
                yaw_test_status = 0U;
                output_phase = 0U;
                vqf_sample_pending = 0U;
                TIM_SetCounter(TIM2, 0U);
                TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
                TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
                TIM_Cmd(TIM2, ENABLE);
                timer_was_enabled = 1U;
            }
        }
    }
}



